keyword = ['경기지사','정호영','bts','한덕수','원희룡','금리','물가','여행',"정부",
"서울시장","인수위","후보자","국정과제","한덕수",'코로나','5g','마우스',
'검수완박','청와대','우크라이나','여가부','경찰','거리두기','계곡살인','한동훈',
'챔피언스리그','조>민','안철수','김진태','IT','북한','유승민','이재명','IMF',
'한국은행','미국','이준석','박지현','전장연','서울시','특별지자체','박범계',
'김오수','문재인','푸틴','마스크','바이든','집값','부동산','넷플릭스','민간인',
'김은혜','선관위','규제','호남','영남','TK','PK','민주당','국민의힘','미국','한국',
'러시아','더불어민주당','중국','국회','검찰','일본','부산','대구','경기도','인천',
'강원도','대통령직인수위원회','수도권','울산','대전','경남','유럽','문재인','제주도',
'영국','춘천','블라디미르 푸틴','광주','네이버','프랑스','서울시','삼성전자','민형배',
'유튜브','기획재정부','뉴욕','롯데','종로구','독일','보건복지부','워싱턴','테슬>라','금융위원회','돈바스','디즈니','마리우폴']



import pymysql
import csv
conn = pymysql.connect(host='localhost', #mysql에 접근할 때 필요한 파라미터
                       user='root',
                       password='MySQL2022!',
                       db='article',
                       charset='utf8')


curs = conn.cursor()
sql = "insert into article (word) values (%s)" #id값은 auto_increment 처리 해두고 
#f = open('text.csv','r',encoding='utf-8')              #본문에서도 id 컬럼을 지운 후 삽입
#rd = csv.reader(f)

for line in keyword:
    curs.execute(sql,(line))
#for line in rd:
 #   curs.execute(sql, (line[0],line[1],line[2],line[3]))
    
conn.commit()
conn.close()
#f.close
    
